---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoomFinishFloor
source: html/50d2b5ee-d787-4bee-bd19-a028eb04f433.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoomFinishFloor Property

"Floor Finish"

## Syntax (C#)
```csharp
public static ForgeTypeId RoomFinishFloor { get; }
```